Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - `Microsoft IIS 5.1 and IIS 6.0 <http://php.net/manual/en/install.windows.iis6.php>`__ - `Microsoft IIS 7.0 and later <http://php.net/manual/en/install.windows.iis7.php>`__ - `PHP for Windows is available here <http://windows.php.net/download/>`__
ja: - `Microsoft IIS 5.1 と IIS 6.0 <http://php.net/manual/en/install.windows.iis6.php>`__ - `Microsoft IIS 7.0 以降 <http://php.net/manual/en/install.windows.iis7.php>`__ - `PHP for Windows はここから入手できます <http://windows.php.net/download/>`__

source: // MySQL SSL CA define('DB_SSL_CA', '/path/to/ca-cert.pem');
ja: // MySQL SSL 認証局 define('DB_SSL_CA', '/path/to/ca-cert.pem');

source: // LDAP bind type: "anonymous", "user" or "proxy"
ja: // LDAPの認証タイプ: "anonymous", "user" or "proxy"

source: - Tested
ja: - テスト中

source: Search by status ~~~~~~~~~~~~~~~~
ja: タスクの状態で検索 ~~~~~~~~~~~~~~~~

source: figure:: /_static/notifications.png :alt: Notifications
ja: figure:: /_static/notifications.png :alt: 通知

source: Edit the ``php.ini``:
ja: ``php.ini`` を編集する:

source: - Web (List of unread messages)
ja: - Web (未読メッセージのリスト)

source: Automatic Actions =================
ja: 自動アクション =================

source: Project Metadata API Procedures ===============================
ja: プロジェクトのメタデータのAPIのプロシージャ ===============================

source: Define automatically user roles based on LDAP groups ----------------------------------------------------
ja: LDAPグループに基づいて自動的にユーザーの役割を定義する ----------------------------------------------------

source: // Log filename if the log driver is "file" define('LOG_FILE', __DIR__.DIRECTORY_SEPARATOR.'data'.DIRECTORY_SEPARATOR.'debug.log');
ja: // ログドライバを "file" にした場合のログファイル名 define('LOG_FILE', __DIR__.DIRECTORY_SEPARATOR.'data'.DIRECTORY_SEPARATOR.'debug.log');

source: User Types ----------
ja: ユーザーのタイプ ----------

source: - Open a task
ja: - タスクを開く

source: - Purpose: **Get user information**
ja: - 用途: **ユーザーの情報を取得する**

source: You can extend the list of compatible events of existing actions by using the same method.
ja: 同じ方法で、互換性のあるイベントのリストの既存のアクションを拡張することができます。

source: Go to the menu **Settings**, then choose **Board settings** on the left.
ja: メニューの **設定** を開いてから、左側の **基本設定** を選択してください。

source: So, you end up developing twice the same application.
ja: 結局、同じアプリケーションを2回開発することになります。

source: Those interfaces are defined in the namepsace ``Kanboard\Core\Security``:
ja: これらのインターフェースは ``Kanboard\Core\Security`` 内の名前空間で定義されています:

source: How to update this documentation?
ja: 文書を更新するにはどうすればよいですか？

source: I want to improve the documentation -----------------------------------
ja: 文書を改良したい -----------------------------------

source: - Postgresql >= 9.3
ja: - Postgresql 9.3以上

source: - If you use a different header for ``REVERSE_PROXY_USER_HEADER``, the value must be prefixed by ``HTTP_`` because it's fetched from the ``$_SERVER`` array.
ja: - ``REVERSE_PROXY_USER_HEADER`` とは違うヘッダーを使用している場合、値の接頭辞は ``HTTP_`` であるべきで、 それは ``$_SERVER`` 配列から取得されるからです。

source: Group Member API Procedures ===========================
ja: グループメンバーのAPIプロシージャ ===========================

source: // Credentials for authentication on the SMTP server (not mandatory) define('MAIL_SMTP_USERNAME', 'username'); define('MAIL_SMTP_PASSWORD', 'super password');
ja: // SMTPサーバーの認証の設定(必須ではない) define('MAIL_SMTP_USERNAME', 'username'); define('MAIL_SMTP_PASSWORD', 'super password');

source: For example, this role is able to create tasks only in the column “Backlog” and to move tasks between the column “Ready” and “Work in progress”.
ja: 例えば、この役割ではカラム **Backlog** にのみタスクを作成し、タスクの移動はカラム"Ready"と"Work in progress"間でのみ移動ができます。

source: The list of supported time zones can be found in the `PHP documentation <http://php.net/manual/en/timezones.america.php>`__.
ja: `PHP documentation <http://php.net/manual/en/timezones.america.php>`__ に、サポートしているタイムゾーンの一覧があります。

source: You should check the user login is sent by the reverse proxy using a HTTP header, and find out which one.
ja: リバースプロキシによるユーザーログインが送信するHTTPヘッダを確認すべきで、そこから何かを見つけられるでしょう。

source: Compatible Operating Systems ~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 互換性のあるOS ~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Purpose: **Add or update metadata**
ja: - 用途: **メタデータを追加または更新する**

source: - Moving a task from the first column
ja: - タスクが最初のカラムから移動されたとき

source: figure:: /_static/new-project.png :alt: Project creation form
ja: figure:: /_static/new-project.png :alt: プロジェクト作成

source: - Database: **kanboard_unit_test**
ja: - データベース: **kanboard_unit_test**

source: // We choose to use Postgresql instead of Sqlite define('DB_DRIVER', 'postgres');
ja: // Sqliteの代わりにPostgreSQLを使用するよう選択する define('DB_DRIVER', 'mysql');// We choose to use Postgresql instead of Sqlite define('DB_DRIVER', 'postgres');

source: When a task is moved to the last column, move the exact same task to another project ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクを最後のカラムに移動したときに、そのタスクを別のプロジェクトに移動する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: HTML output:
ja: HTML での出力:

source: Each project have an analytics section.
ja: 個々のプロジェクトには、「分析」セクションがあります。

source: Second example with user mode:
ja: 2つ目の例は user モードです:

source: Kanboard is able to load groups from an external system.
ja: Kanboardは外部システムからグループを読み込むことができます。

source: figure:: /_static/project-edition.png :alt: Project edition
ja: figure:: /_static/project-edition.png :alt: プロジェクトの編集

source: By default, Kanboard will create a user account automatically if nothing is found.
ja: デフォルトでは、Kanboardはユーザーアカウントが見つからない場合に自動的にアカウントを作成します。

source: - Cookie based authentication (Remember Me)
ja: - Cookie ベースの認証 (Remember Me)

source: Application Hooks -----------------
ja: アプリケーションのフック -----------------

source: Open the file ``C:\Apache24\conf\httpd.conf`` and add the directive:
ja: ``C:\Apache24\conf\httpd.conf`` を開き、以下のディレクティブを追加する*

source: - Purpose: **Get all groups**
ja: - 用途: **全てのグループを取得する**

source: Allowing external connections is necessary if you use LDAP, SMTP, Web hooks or any third-party integration.
ja: LDAP, SMTP, Webhookやその他の外部統合を使用する場合、外部コネクションを許容することが必要です。

source: - Purpose: **Get the list of enabled swimlanes of a project (include default swimlane if enabled)**
ja: - 用途: **プロジェクトの有効なスイムレーンのリストを取得する(有効ならば、デフォルトのスイムレーンを含む)**

source: - Result on success: **swimlane_id**
ja: - 成功時の返り値: **swimlane_id**

source: Search by event creation date ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: イベント作成日で検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Various settings ----------------
ja: 様々な設定 ----------------

source: For example, you may have a lead time of 100 days but only have to work 1 hour to complete the task.
ja: 例えば、リードタイムが100日であっても、実際にはたった1時間の作業で完了することもあり得ます。

source: - Browser
ja: - ブラウザ

source: Encode the credentials in Base64, example with PHP
ja: 資格情報を Base64 でエンコードしてください。 PHPでの例は、

source: - Automatically assign a category based on a link
ja: - リンクに基づいてカテゴリを変える

source: - This chart shows the total time spent into each column for the task.
ja: - このチャートは各カラムでの経過時間の合計を表示します。

source: Grant/Denied access based on the project access map
ja: プロジェクトのアクセスマップを元にアクセス件を付与/拒否する

source: // LDAP attribute for the user in the group filter
ja: // グループ内でのユーザーのフィルターに使用するLDAP属性

source: forcing SSL) 7.
ja: SSL接続の強制) 7.

source: - Assembly
ja: - 組立

source: - Choose action: **Duplicate the task to another project**
ja: - アクション: **別のプロジェクトにタスクを複製** を選択

source: If external HTTP requests need to be sent through a proxy:
ja: 外部HTTPリクエストはproxyを通しての送信が必要な場合:

source: - Result on success: **Dashboard information**
ja: - 成功時の返り値: **ダッシュボードの情報**

source: - Purpose: **Grant access to a project for a group**
ja: - 用途: **グループにプロジェクトへのアクセス権を与える**

source: Creating a new action ---------------------
ja: 新しいアクションを作成する ---------------------

source: // Enable LDAP group provider for project permissions // The end-user will be able to browse LDAP groups from the user interface and allow access to specified projects define('LDAP_GROUP_PROVIDER', false);
ja: // LDAP グループプロバイダをプロジェクトの権限設定に使用する // エンドユーザーはユーザーインターフェースからLDAPグループをブラウズできるようになり、特定のプロジェクトへのアクセスを許可します。 define('LDAP_GROUP_PROVIDER', false);

source: Those metrics are calculated and recorded every day for the whole project.
ja: これらはプロジェクト全体で、毎日計測され、計算され、記録されます。

source: When you go to the **users** menu, you have the list of users, to modify a user click on the **edit link**.
ja: メニュー内の **ユーザー管理** を開くと、ユーザーの一覧が表示されるので、編集するユーザーの **編集** リンクをクリックしてください。

source: Task link creation:
ja: タスクのリンクの作成:

source: Creating Tasks --------------
ja: タスクの作成 --------------

source: You can hide or display columns very easily on the board:
ja: ボード上のカラムの表示/非表示は簡単に切り替えられます:

source: // Mysql/Postgres database name
ja: // Mysql/Postgres データベース名

source: External Task Link API Procedures =================================
ja: タスクの外部リンクのAPIプロシージャ =================================

source: - Define action parameters: **Column = Validated** and **Project = Production**
ja: - アクションのパラメータ: **カラム = 確認済** と、 **プロジェクト = 生産** を定義

source: You can create custom project roles to apply a set of specific restrictions on the people that belong to this role.
ja: この役目に属する人に特定の制限を掛けるために、プロジェクト独自の役割を作成できます。

source: To receive email notifications you need a valid email address in your profile and the application must be configured to send emails.
ja: Email通知を受け取るには、ユーザー設定から有効なメールアドレスを設定するとともに、アプリケーションがEmailを送るように設定しなければなりません。

source: - Uploaded files are not persistent after a restart.
ja: - アップロードしたファイルは再起動後は恒久的ではありません。

source: - UserMetadata: ``$this->userMetadataModel``
ja: - ユーザーのメタデータ: ``$this->userMetadataModel``

source: // LDAP server hostname define('LDAP_SERVER', '');
ja: // LDAP のサーバーのホスト名 define('LDAP_SERVER', '');

source: How to test Kanboard with the PHP built-in web server?
ja: PHPビルトインのwebサーバーでKanboardをテストするにはどうすれば良いですか?

source: ``project:"My project A" project:"My project B"``
ja: - 複数のプロジェクトからタスクを検索: ``project:"My project A" project:"My project B"``

source: // LDAP pattern to use when searching for a user account // Example for ActiveDirectory: '(&(objectClass=user)(sAMAccountName=%s))' // Example for OpenLDAP: 'uid=%s' define('LDAP_USER_FILTER', '');
ja: // LDAP でユーザーアカウントの検索に使用するパターン // ActiveDirectory の例 : '(&(objectClass=user)(sAMAccountName=%s))' // OpenLDAP の例 : 'uid=%s' define('LDAP_USER_FILTER', '');

source: - The web hook token is also sent as a query string parameter, so you can check if the request really comes from Kanboard.
ja: - また、Webhookのトークンはクエリの文字列のパラメータも送るので、本当にKanboardからリクエストが来たのかを確かめる事ができます。

source: - Result on success: **Timezone** (Example: UTC, Europe/Paris)
ja: - 成功時の返り値: **タイムゾーン** (例:UTC, Europe/Paris)

source: Task view ---------
ja: タスクビュー ---------

source: - Purpose: **Change the column position**
ja: - 用途: **カラムの位置を変更する**

source: figure:: /_static/application-settings.png :alt: Application settings
ja: figure:: /_static/application-settings.png :alt: アプリケーションの設定

source: Protocol --------
ja: プロトコル --------

source: - Purpose: **Update a comment**
ja: - 用途: **コメントの更新**

source: - When an event is triggered Kanboard calls the pre-defined URL automatically
ja: - Kanboardのイベントをトリガーされた時に、事前定義済みのURLが自動的に呼び出されます。

source: - **title** (string, required)
ja: - **title** (string, 必須)

source: - Work-in-progress
ja: - 仕掛作業

source: Configuration -------------
ja: 設定 -------------

source: - Purpose: **Remove a user from a group**
ja: - 用途: **グループからユーザーを削除する**

source: // Mysql SSL key define('DB_SSL_KEY', null);
ja: // Mysql のSSL キー define('DB_SSL_KEY', null);

source: If we have the URL ``/my/route/foobar``, the value of ``my_variable`` is ``foobar``:
ja: URLが ``/my/route/foobar`` の場合、変数 ``my_variable`` の値は``foobar` です`:

source: # install required packages sudo zypper install apache2-mod_php7 php7-openssl php7-gd php7-mbstring php7-mcrypt php7-mysql php7-xmlrpc php7-ctype php7-json
ja: # 必要なパッケージをインストールする sudo zypper install apache2-mod_php7 php7-openssl php7-gd php7-mbstring php7-mcrypt php7-mysql php7-xmlrpc php7-ctype php7-json

source: Then the task creation form appears:
ja: タスク作成フォームが表示されます:

source: Directory structure -------------------
ja: ディレクトリの構造 -------------------

source: - You can switch SELinux to the permissive mode or disable it (not recommended)
ja: - SELinuxをpermissiveモードか無効に切り替えることができます(非推奨)

source: The RSS link is protected by a random token, only people who know the URL can access to the feed.
ja: RSSのリンクはランダムトークンで保護されていて、URLを知っている人のみがアクセスできます。

source: When a task is closed, it is hidden from the board.
ja: タスクを完了すると、ボードからは非表示になります。

source: Refresh interval for private board ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 非公開ボードの更新頻度 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Switching from one view to another can be done with the keyboard shortcut **"s"** or by using the drop-down menu on the left.
ja: これらの表示の相互切り替えはショートカットキーの **"s"** キーか、上部左のドロップダウンメニューから行えます。

source: Enable/Disable User RSS Feeds -----------------------------
ja: ユーザーのRSSフィードを有効化/無効化する --------------------------------

source: Add new API methods -------------------
ja: 新しいAPIのメソッドを追加する -------------------

source: - To update this documentation, send a pull-request to the project mentioned above.
ja: - この文書を更新するには、上述したようにプロジェクトにプルリクエストを送ってください。

source: warning:: **Security measures:**
ja: 警告:: **セキュリティ対策:**

source: - `Turkish <https://github.com/kanboard/documentation-tr>`_
ja: - `トルコ語 <https://github.com/kanboard/documentation-tr>`_

source: - The color of each column is determined automatically.
ja: - 自動的に、各カラム毎に色分けされます。

source: - Result on success: **comment_id**
ja: - 成功時の返り値: **comment_id**

source: Bug Tracking ~~~~~~~~~~~~
ja: バグ追跡 ~~~~~~~~~~~~

source: - Purpose: **Remove a link between two tasks**
ja: - Purpose: **2つのタスク間のリンクを削除する**

source: - Project: Notifications configured at the project level
ja: - プロジェクト: プロジェクトレベルでの通知設定

source: - Purpose: **Get all tags for a given project**
ja: - 用途: **プロジェクトに与えられた全てのタグを取得する**

source: Authentication Types --------------------
ja: 認証タイプ --------------------

source: You can try Kanboard for free on `Heroku <https://www.heroku.com/>`__.
ja: Kanboardを無料で `Heroku <https://www.heroku.com/>`__ で試すことができます。

source: Register a new notification type --------------------------------
ja: 新しい通知の形を追加 --------------------------------

source: Removing Projects -----------------
ja: プロジェクトの削除 -----------------

source: - The default credentials are **admin/admin**
ja: - 初期設定のユーザー名・パスワードは **admin/admin** です。

source: - Search tasks due tomorrow: ``due:tomorrow``
ja: - 明日が期限のタスクを選択: ``due:tomorrow``

source: - You can access to the application by using the URL
ja: - 以下のURLでアプリケーションにアクセスできます。

source: Several date format are accepted in addition to the date picker.
ja: date pickerに加えて、いくつかの日付フォーマットが使用できます。

source: - **recurrence_timeframe** (integer, optional)
ja: - **recurrence_timeframe** (integer, 任意)

source: // LDAP attribute for user email
ja: // LDAP 属性のユーザーのemailアドレス

source: SSL configuration -----------------
ja: SSL の設定 -----------------

source: You can choose your favorite notification method:
ja: お好みの通知方法を選択できます。:

source: Acceptance tests (also sometimes known as end-to-end tests, and functional tests) test the actual functionality of the UI in a browser using Selenium.
ja: 受入テスト (もしくは end-to-end テスト、機能テスト) はSeleniumを使用してブラウザ上のUIが実際に機能するかテストします。

source: - Search by task id: ``#123``
ja: - タスクIDで検索: ``#123``

source: +--------------------------------+-----------------------------------------------+ | Method | Description | +================================+===============================================+ | ``render(array $user, $size)`` | Render HTML | +--------------------------------+-----------------------------------------------+ | ``isActive(array $user)`` | Returns a boolean if the provider is able to | | | render something | +--------------------------------+-----------------------------------------------+
ja: +--------------------------------+-----------------------------------------------+ | メソッド | 概要 | +================================+===============================================+ | ``render(array $user, $size)`` | HTML のレンダー | +--------------------------------+-----------------------------------------------+ | ``isActive(array $user)`` | 何かレンダーが提供可能かどうか | | | booleanの値で返す | +--------------------------------+-----------------------------------------------+

source: Usage -----
ja: 使用方法 -----

source: - **description** Markdown content (string, optional)
ja: - **description** Markdown 形式 (string, 任意)

source: Registering new helpers =======================
ja: 新しいヘルパーを登録する =======================

source: Server Settings ---------------
ja: サーバーの設定 ---------------

source: - **Time Spent**: Time spent working on the task.
ja: - **経過時間**: タスクが動いているのに経過した時間です。

source: API Authentication ==================
ja: API 認証 ==================

source: External Link Providers =======================
ja: 外部リンクのプロバイダ =======================

source: For each execution the database is dropped and created again.
ja: 実行ごとにデータベースは破棄され、再度生成されます。

source: - Purpose: **Get all tags**
ja: - 用途: **全てのタグを取得する**

source: note:: Check the :ref:`requirements <requirements>` before going further.
ja: 注意:: 先に進む前に :ref:`システム要件 <requirements>` を確認してください。

source: Custom Filters --------------
ja: カスタムフィルタ --------------

source: - If you want to add a new feature, respect the philosophy behind Kanboard.
ja: - 新しい特徴の追加を要望するならば、Kanboardの背景にある哲学を尊重してください。

source: - Create a comment from an external provider
ja: - 外部サービスからコメントを作成

source: You can also download at any time the database directly from the **settings** menu.
ja: また、いつでも **設定** メニューからデータベースを直接ダウンロードできます。

source: This authentication method is often used for `SSO <http://en.wikipedia.org/wiki/Single_sign-on>`__ (Single Sign-On) especially for large organizations.
ja: この認証方法は、しばしば特に大きな組織で `シングルサインオン <https://ja.wikipedia.org/wiki/%E3%82%B7%E3%83%B3%E3%82%B0%E3%83%AB%E3%82%B5%E3%82%A4%E3%83%B3%E3%82%AA%E3%83%B3>`__ (SSO) に使われます。

source: - View the description of the project.
ja: - プロジェクトの概評を表示します。

source: Template Overrides ------------------
ja: テンプレートのオーバーライド ------------------

source: There must be at least 3 dashes separating each header cell.
ja: ヘッダーとセルを区切るには、少なくとも3つのダッシュ(-)を置かなければなりません。

source: - Result on success: **task link properties**
ja: - 成功時の返り値: **タスクのリンクのプロパティ**

source: - Each migration is executed in a transaction
ja: - 個々のマイグレーションはトランザクションとして実行されます。

source: Each time you enable or disable public access, a new random token is generated.
ja: 公開アクセスの有効化/無効化するごとに、新しいランダムトークンが生成されます

source: - Tasks with the status open are visible on the board and tasks with the status closed is hidden by default on the board.
ja: - 未完了タスクはボード上に表示され、完了済みのタスクはデフォルトではボード上に表示されません。

source: - **status** (int, optional)
ja: - **status** (int, 任意)

source: - Purpose: **Move up the swimlane position** (only for active swimlanes)
ja: - 用途: **プロジェクトのスイムレーンの位置を変更する(有効なスイムレーンのみ)**

source: Go to the failed migration function 3.
ja: マイグレーションを失敗した関数に移動する 3.

source: - **score** (integer, optional)
ja: - **score** (integer, 任意)

source: In the method ``initialize()`` of your plugin, call the method ``register()`` of the class ``AuthenticationManager``:
ja: プラグイン中の ``initialize()`` メソッド内で ``AuthenticationManager`` クラス内の ``register()`` メソッドを呼ぶ事ができます:

source: Examples of mail transport plugins ----------------------------------
ja: メール送信プラグインの例 ----------------------------------

source: User API ~~~~~~~~
ja: ユーザー API ~~~~~~~~

source: - Purpose: **Get subtask information**
ja: - 用途: **サブタスクの情報を取得する**

source: In the section ``server`` of your Nginx config file you can use this example:
ja: Nginxの設定ファイルの ``server`` セクションで使用可能な例:

source: - Some features of Kanboard requires that you run a daily background job.
ja: - Kanboardのいくつかの特徴は、毎日のバックグラウンドジョブの実行を必要とします。

source: - User feeds contains the activity stream of all projects the user is a member
ja: - ユーザーのRSS/Atomフィードはそのユーザーがメンバーになっているすべてのプロジェクトの状況を配信します。

source: figure:: /_static/google-calendar-add-subscription.png :alt: Google Calendar
ja: figure:: /_static/google-calendar-add-subscription.png :alt: Googleカレンダー

source: Remove two-factor authentication for a user ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: ユーザーの二要素認証を削除する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Add or update translations
ja: - 翻訳ファイルを追加or更新する

source: // This example will not synchronize the fields "username" and "role" from LDAP to Kanboard.
ja: // この例では、LDAPからKanboardにフィールド "username" と "role" を同期しません。

source: - Purpose: **Get a task link**
ja: - Purpose: **タスクのリンクを取得する**

source: If the link type is “auto”, Kanboard will loop through all providers registered until there is a match 3.
ja: リンクのタイプが “auto” ならば、Kanboardは見合うものがあるまで全ての登録済みプロバイダを順繰りに当たります。 3.

source: Workflow --------
ja: ワークフロー --------

source: - Translate the documents
ja: - 文書を翻訳する
